Data/SimulationFiles/K23_Re1350/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version 	2.0;
	format 		ascii;
	class 		dictionary;
	location 	"system";
	object 		fvOptions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../config"
momentumSource
{
	type 	meanVelocityForce;
	active 	yes;
	
	meanVelocityForceCoeffs
	{
		selectionMode 	all;
		
		fields 			( U );
		Ubar 			($Ubar 0 0);
		relaxation 		1.0;
	}
}
// ************************************************************************* //
